Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e4xx_hal.h
/**
  ******************************************************************************
  * @file    py32e4xx_hal.h
  * @author  MCU Application Team
  * @brief   This file contains all the functions prototypes for the HAL
  *          module driver.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __PY32E4xx_HAL_H
#define __PY32E4xx_HAL_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "py32e407_hal_conf.h"

/** @addtogroup PY32E407_HAL_Driver
  * @{
  */

/** @addtogroup HAL
  * @{
  */

/* Exported constants --------------------------------------------------------*/

/** @defgroup HAL_Exported_Constants HAL Exported Constants
  * @{
  */

/** @defgroup HAL_TICK_FREQ Tick Frequency
  * @{
  */
#define HAL_TICK_FREQ_10HZ          100U
#define HAL_TICK_FREQ_100HZ         10U
#define HAL_TICK_FREQ_1KHZ          1U
#define HAL_TICK_FREQ_DEFAULT       HAL_TICK_FREQ_1KHZ
  
/**
  * @}
  */
/**
  * @}
  */

/* Exported types ------------------------------------------------------------*/

/* Exported variables --------------------------------------------------------*/
/** @addtogroup HAL_Exported_Variables
  * @{
  */
extern uint32_t uwTickPrio;
extern uint32_t uwTickFreq;
/**
  * @}
  */

/* SYSCFG Exported Constants -------------------------------------------------*/
/** @defgroup SYSCFG_Exported_Constants SYSCFG Exported Constants
  * @{
  */

/** @defgroup SYSCFG_BootMode Boot Mode
  * @{
  */
#define SYSCFG_BOOT_MAINFLASH          0x00000000U
#define SYSCFG_BOOT_SYSTEMFLASH        SYSCFG_CFGR1_MEM_MODE_0
#define SYSCFG_BOOT_ESMC               SYSCFG_CFGR1_MEM_MODE_1
#define SYSCFG_BOOT_SRAM               (SYSCFG_CFGR1_MEM_MODE_1 | SYSCFG_CFGR1_MEM_MODE_0)
/**
  * @}
  */

/** @defgroup SYSCFG_ETH_PHY_Interface ETH PHY Interface
  * @{
  */
#define SYSCFG_ETH_PHY_MII             0x00000000U
#define SYSCFG_ETH_PHY_RMII            SYSCFG_CFGR1_ETH_PHYSEL
/**
  * @}
  */

/** @defgroup SYSCFG_I2C_ANF I2C Analog Filter
  * @{
  */
#define SYSCFG_I2C_ANF_PA8            SYSCFG_CFGR1_I2C_EIIC_0
#define SYSCFG_I2C_ANF_PA9            SYSCFG_CFGR1_I2C_EIIC_1
#define SYSCFG_I2C_ANF_PA13           SYSCFG_CFGR1_I2C_EIIC_2
#define SYSCFG_I2C_ANF_PA14           SYSCFG_CFGR1_I2C_EIIC_3
#define SYSCFG_I2C_ANF_PA15           SYSCFG_CFGR1_I2C_EIIC_4
#define SYSCFG_I2C_ANF_PB5            SYSCFG_CFGR1_I2C_EIIC_5
#define SYSCFG_I2C_ANF_PB7            SYSCFG_CFGR1_I2C_EIIC_6
#define SYSCFG_I2C_ANF_PB8            SYSCFG_CFGR1_I2C_EIIC_7
#define SYSCFG_I2C_ANF_PB9            SYSCFG_CFGR1_I2C_EIIC_8
#define SYSCFG_I2C_ANF_PC3            SYSCFG_CFGR1_I2C_EIIC_9
#define SYSCFG_I2C_ANF_PC6            SYSCFG_CFGR1_I2C_EIIC_10
#define SYSCFG_I2C_ANF_PC7            SYSCFG_CFGR1_I2C_EIIC_11
#define SYSCFG_I2C_ANF_PC8            SYSCFG_CFGR1_I2C_EIIC_12
#define SYSCFG_I2C_ANF_PC9            SYSCFG_CFGR1_I2C_EIIC_13
#define SYSCFG_I2C_ANF_PC11           SYSCFG_CFGR1_I2C_EIIC_14
#define SYSCFG_I2C_ANF_PF0            SYSCFG_CFGR1_I2C_EIIC_15
/**
  * @}
  */

/** @defgroup SYSCFG_TIM2_INTERNAL_TRIGGER1_REMAP TIM2 internal trigger1 remap
  * @{
  */
#define SYSCFG_TIM2_INTERNAL_TRIGGER1_NONE          0x00000000U
#define SYSCFG_TIM2_INTERNAL_TRIGGER1_USB1_SOF      SYSCFG_CFGR1_TIM2ITR1_REMAP_0  /*!< TIM2ITR1 remaps to USB1_SOF */
#define SYSCFG_TIM2_INTERNAL_TRIGGER1_USB2_SOF      SYSCFG_CFGR1_TIM2ITR1_REMAP_1  /*!< TIM2ITR1 remaps to USB2_SOF */
#define SYSCFG_TIM2_INTERNAL_TRIGGER1_ETH_PTP_INTR  SYSCFG_CFGR1_TIM2ITR1_REMAP    /*!< TIM2ITR1 remaps to ETH_PTP_INTR */
/**
  * @}
  */

/** @defgroup SYSCFG_flags_definition Flags
  * @{
  */
#define SYSCFG_FLAG_SRAM_PE             SYSCFG_CFGR2_SPF       /*!< SRAM parity error (first 32kB of SRAM1 + CCM SRAM) */
#define SYSCFG_FLAG_CCMSRAM_BUSY        SYSCFG_SCSR_CCMBSY     /*!< CCMSRAM busy by erase operation */
/**
  * @}
  */

/** @defgroup SYSCFG_CCMSRAMWRP CCM Write protection
  * @{
  */
#define SYSCFG_CCMSRAMWRP_PAGE0          SYSCFG_SWPR_P0WP  /*!< CCMSRAM Write protection page 0 */
#define SYSCFG_CCMSRAMWRP_PAGE1          SYSCFG_SWPR_P1WP  /*!< CCMSRAM Write protection page 1 */
#define SYSCFG_CCMSRAMWRP_PAGE2          SYSCFG_SWPR_P2WP  /*!< CCMSRAM Write protection page 2 */
#define SYSCFG_CCMSRAMWRP_PAGE3          SYSCFG_SWPR_P3WP  /*!< CCMSRAM Write protection page 3 */
#define SYSCFG_CCMSRAMWRP_PAGE4          SYSCFG_SWPR_P4WP  /*!< CCMSRAM Write protection page 4 */
#define SYSCFG_CCMSRAMWRP_PAGE5          SYSCFG_SWPR_P5WP  /*!< CCMSRAM Write protection page 5 */
#define SYSCFG_CCMSRAMWRP_PAGE6          SYSCFG_SWPR_P6WP  /*!< CCMSRAM Write protection page 6 */
#define SYSCFG_CCMSRAMWRP_PAGE7          SYSCFG_SWPR_P7WP  /*!< CCMSRAM Write protection page 7 */
#define SYSCFG_CCMSRAMWRP_PAGE8          SYSCFG_SWPR_P8WP  /*!< CCMSRAM Write protection page 8 */
#define SYSCFG_CCMSRAMWRP_PAGE9          SYSCFG_SWPR_P9WP  /*!< CCMSRAM Write protection page 9 */
#define SYSCFG_CCMSRAMWRP_PAGE10         SYSCFG_SWPR_P10WP /*!< CCMSRAM Write protection page 10 */
#define SYSCFG_CCMSRAMWRP_PAGE11         SYSCFG_SWPR_P11WP /*!< CCMSRAM Write protection page 11 */
#define SYSCFG_CCMSRAMWRP_PAGE12         SYSCFG_SWPR_P12WP /*!< CCMSRAM Write protection page 12 */
#define SYSCFG_CCMSRAMWRP_PAGE13         SYSCFG_SWPR_P13WP /*!< CCMSRAM Write protection page 13 */
#define SYSCFG_CCMSRAMWRP_PAGE14         SYSCFG_SWPR_P14WP /*!< CCMSRAM Write protection page 14 */
#define SYSCFG_CCMSRAMWRP_PAGE15         SYSCFG_SWPR_P15WP /*!< CCMSRAM Write protection page 15 */
#define SYSCFG_CCMSRAMWRP_PAGE16         SYSCFG_SWPR_P16WP /*!< CCMSRAM Write protection page 16 */
#define SYSCFG_CCMSRAMWRP_PAGE17         SYSCFG_SWPR_P17WP /*!< CCMSRAM Write protection page 17 */
#define SYSCFG_CCMSRAMWRP_PAGE18         SYSCFG_SWPR_P18WP /*!< CCMSRAM Write protection page 18 */
#define SYSCFG_CCMSRAMWRP_PAGE19         SYSCFG_SWPR_P19WP /*!< CCMSRAM Write protection page 19 */
#define SYSCFG_CCMSRAMWRP_PAGE20         SYSCFG_SWPR_P20WP /*!< CCMSRAM Write protection page 20 */
#define SYSCFG_CCMSRAMWRP_PAGE21         SYSCFG_SWPR_P21WP /*!< CCMSRAM Write protection page 21 */
#define SYSCFG_CCMSRAMWRP_PAGE22         SYSCFG_SWPR_P22WP /*!< CCMSRAM Write protection page 22 */
#define SYSCFG_CCMSRAMWRP_PAGE23         SYSCFG_SWPR_P23WP /*!< CCMSRAM Write protection page 23 */
#define SYSCFG_CCMSRAMWRP_PAGE24         SYSCFG_SWPR_P24WP /*!< CCMSRAM Write protection page 24 */
#define SYSCFG_CCMSRAMWRP_PAGE25         SYSCFG_SWPR_P25WP /*!< CCMSRAM Write protection page 25 */
#define SYSCFG_CCMSRAMWRP_PAGE26         SYSCFG_SWPR_P26WP /*!< CCMSRAM Write protection page 26 */
#define SYSCFG_CCMSRAMWRP_PAGE27         SYSCFG_SWPR_P27WP /*!< CCMSRAM Write protection page 27 */
#define SYSCFG_CCMSRAMWRP_PAGE28         SYSCFG_SWPR_P28WP /*!< CCMSRAM Write protection page 28 */
#define SYSCFG_CCMSRAMWRP_PAGE29         SYSCFG_SWPR_P29WP /*!< CCMSRAM Write protection page 29 */
#define SYSCFG_CCMSRAMWRP_PAGE30         SYSCFG_SWPR_P30WP /*!< CCMSRAM Write protection page 30 */
#define SYSCFG_CCMSRAMWRP_PAGE31         SYSCFG_SWPR_P31WP /*!< CCMSRAM Write protection page 31 */

/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup HAL_Exported_Macros HAL Exported Macros
  * @{
  */

/** @defgroup DBGMCU_Freeze_Unfreeze Freeze Unfreeze Peripherals in Debug mode
  * @brief   Freeze/Unfreeze Peripherals in Debug mode
  * Note: On devices PY32E4xx
  *       Debug registers DBGMCU_IDCODE and DBGMCU_CR are accessible only in
  *       debug mode (not accessible by the user software in normal mode).
  *       Refer to errata sheet of these devices for more details.
  * @{
  */

/**
  * @brief  IWDG Peripherals Debug mode
  */
#if defined (DBGMCU_CR1_DBG_IWDG_STOP)
#define __HAL_DBGMCU_FREEZE_IWDG()            SET_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_IWDG_STOP)
#define __HAL_DBGMCU_UNFREEZE_IWDG()          CLEAR_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_IWDG_STOP)
#endif

/**
  * @brief  WWDG Peripherals Debug mode
  */
#if defined (DBGMCU_CR1_DBG_WWDG_STOP)
#define __HAL_DBGMCU_FREEZE_WWDG()            SET_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_WWDG_STOP)
#define __HAL_DBGMCU_UNFREEZE_WWDG()          CLEAR_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_WWDG_STOP)
#endif

/**
  * @brief  TIM1 Peripherals Debug mode
  */
#if defined (DBGMCU_CR1_DBG_TIM1_STOP)
#define __HAL_DBGMCU_FREEZE_TIM1()            SET_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM1_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM1()          CLEAR_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM1_STOP)
#endif

/**
  * @brief  TIM2 Peripherals Debug mode
  */
#if defined (DBGMCU_CR1_DBG_TIM2_STOP)
#define __HAL_DBGMCU_FREEZE_TIM2()            SET_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM2_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM2()          CLEAR_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM2_STOP)
#endif

/**
  * @brief  TIM3 Peripherals Debug mode
  */
#if defined (DBGMCU_CR1_DBG_TIM3_STOP)
#define __HAL_DBGMCU_FREEZE_TIM3()            SET_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM3_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM3()          CLEAR_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM3_STOP)
#endif

/**
  * @brief  TIM4 Peripherals Debug mode
  */
#if defined (DBGMCU_CR1_DBG_TIM4_STOP)
#define __HAL_DBGMCU_FREEZE_TIM4()            SET_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM4_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM4()          CLEAR_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM4_STOP)
#endif

/**
  * @brief  CAN Peripherals Debug mode
  */
#if defined (DBGMCU_CR1_DBG_CAN1_STOP)
#define __HAL_DBGMCU_FREEZE_CAN1()            SET_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_CAN1_STOP)
#define __HAL_DBGMCU_UNFREEZE_CAN1()          CLEAR_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_CAN1_STOP)
#endif

/**
  * @brief  I2C1 Peripherals Debug mode
  */
#if defined (DBGMCU_CR1_DBG_I2C1_SMBUS_TIMEOUT)
#define __HAL_DBGMCU_FREEZE_I2C1_TIMEOUT()    SET_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_I2C1_SMBUS_TIMEOUT)
#define __HAL_DBGMCU_UNFREEZE_I2C1_TIMEOUT()  CLEAR_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_I2C1_SMBUS_TIMEOUT)
#endif

/**
  * @brief  I2C2 Peripherals Debug mode
  */
#if defined (DBGMCU_CR1_DBG_I2C2_SMBUS_TIMEOUT)
#define __HAL_DBGMCU_FREEZE_I2C2_TIMEOUT()    SET_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_I2C2_SMBUS_TIMEOUT)
#define __HAL_DBGMCU_UNFREEZE_I2C2_TIMEOUT()  CLEAR_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_I2C2_SMBUS_TIMEOUT)
#endif

/**
  * @brief  TIM8 Peripherals Debug mode
  */
#if defined (DBGMCU_CR1_DBG_TIM8_STOP)
#define __HAL_DBGMCU_FREEZE_TIM8()            SET_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM8_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM8()          CLEAR_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM8_STOP)
#endif

/**
  * @brief  TIM5 Peripherals Debug mode
  */
#if defined (DBGMCU_CR1_DBG_TIM5_STOP)
#define __HAL_DBGMCU_FREEZE_TIM5()            SET_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM5_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM5()          CLEAR_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM5_STOP)
#endif

/**
  * @brief  TIM6 Peripherals Debug mode
  */
#if defined (DBGMCU_CR1_DBG_TIM6_STOP)
#define __HAL_DBGMCU_FREEZE_TIM6()            SET_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM6_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM6()          CLEAR_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM6_STOP)
#endif

/**
  * @brief  TIM7 Peripherals Debug mode
  */
#if defined (DBGMCU_CR1_DBG_TIM7_STOP)
#define __HAL_DBGMCU_FREEZE_TIM7()            SET_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM7_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM7()          CLEAR_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM7_STOP)
#endif

/**
  * @brief  TIM12 Peripherals Debug mode
  */
#if defined (DBGMCU_CR1_DBG_TIM12_STOP)
#define __HAL_DBGMCU_FREEZE_TIM12()            SET_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM12_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM12()          CLEAR_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM12_STOP)
#endif

/**
  * @brief  TIM13 Peripherals Debug mode
  */
#if defined (DBGMCU_CR1_DBG_TIM13_STOP)
#define __HAL_DBGMCU_FREEZE_TIM13()            SET_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM13_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM13()          CLEAR_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM13_STOP)
#endif

/**
  * @brief  TIM14 Peripherals Debug mode
  */
#if defined (DBGMCU_CR1_DBG_TIM14_STOP)
#define __HAL_DBGMCU_FREEZE_TIM14()            SET_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM14_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM14()          CLEAR_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM14_STOP)
#endif

/**
  * @brief  TIM9 Peripherals Debug mode
  */
#if defined (DBGMCU_CR1_DBG_TIM9_STOP)
#define __HAL_DBGMCU_FREEZE_TIM9()            SET_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM9_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM9()          CLEAR_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM9_STOP)
#endif

/**
  * @brief  TIM10 Peripherals Debug mode
  */
#if defined (DBGMCU_CR1_DBG_TIM10_STOP)
#define __HAL_DBGMCU_FREEZE_TIM10()            SET_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM10_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM10()          CLEAR_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM10_STOP)
#endif

/**
  * @brief  TIM11 Peripherals Debug mode
  */
#if defined (DBGMCU_CR1_DBG_TIM11_STOP)
#define __HAL_DBGMCU_FREEZE_TIM11()            SET_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM11_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM11()          CLEAR_BIT(DBGMCU->CR1, DBGMCU_CR1_DBG_TIM11_STOP)
#endif

/**
  * @brief  I2C3 Peripherals Debug mode
  */
#if defined (DBGMCU_CR2_DBG_I2C3_SMBUS_TIMEOUT)
#define __HAL_DBGMCU_FREEZE_I2C3_TIMEOUT()            SET_BIT(DBGMCU->CR2, DBGMCU_CR2_DBG_I2C3_SMBUS_TIMEOUT)
#define __HAL_DBGMCU_UNFREEZE_I2C3_TIMEOUT()          CLEAR_BIT(DBGMCU->CR2, DBGMCU_CR2_DBG_I2C3_SMBUS_TIMEOUT)
#endif

/**
  * @brief  I2C4 Peripherals Debug mode
  */
#if defined (DBGMCU_CR2_DBG_I2C4_SMBUS_TIMEOUT)
#define __HAL_DBGMCU_FREEZE_I2C4_TIMEOUT()            SET_BIT(DBGMCU->CR2, DBGMCU_CR2_DBG_I2C4_SMBUS_TIMEOUT)
#define __HAL_DBGMCU_UNFREEZE_I2C4_TIMEOUT()          CLEAR_BIT(DBGMCU->CR2, DBGMCU_CR2_DBG_I2C4_SMBUS_TIMEOUT)
#endif

/**
  * @brief  CAN2 Peripherals Debug mode
  */
#if defined (DBGMCU_CR2_DBG_CAN2_STOP)
#define __HAL_DBGMCU_FREEZE_CAN2()            SET_BIT(DBGMCU->CR2, DBGMCU_CR2_DBG_CAN2_STOP)
#define __HAL_DBGMCU_UNFREEZE_CAN2()          CLEAR_BIT(DBGMCU->CR2, DBGMCU_CR2_DBG_CAN2_STOP)
#endif

/**
  * @brief  TIM15 Peripherals Debug mode
  */
#if defined (DBGMCU_CR2_DBG_TIM15_STOP)
#define __HAL_DBGMCU_FREEZE_TIM15()            SET_BIT(DBGMCU->CR2, DBGMCU_CR2_DBG_TIM15_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM15()          CLEAR_BIT(DBGMCU->CR2, DBGMCU_CR2_DBG_TIM15_STOP)
#endif

/**
  * @brief  TIM16 Peripherals Debug mode
  */
#if defined (DBGMCU_CR2_DBG_TIM16_STOP)
#define __HAL_DBGMCU_FREEZE_TIM16()            SET_BIT(DBGMCU->CR2, DBGMCU_CR2_DBG_TIM16_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM16()          CLEAR_BIT(DBGMCU->CR2, DBGMCU_CR2_DBG_TIM16_STOP)
#endif

/**
  * @brief  TIM17 Peripherals Debug mode
  */
#if defined (DBGMCU_CR2_DBG_TIM17_STOP)
#define __HAL_DBGMCU_FREEZE_TIM17()            SET_BIT(DBGMCU->CR2, DBGMCU_CR2_DBG_TIM17_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM17()          CLEAR_BIT(DBGMCU->CR2, DBGMCU_CR2_DBG_TIM17_STOP)
#endif

/**
  * @brief  TIM18 Peripherals Debug mode
  */
#if defined (DBGMCU_CR2_DBG_TIM18_STOP)
#define __HAL_DBGMCU_FREEZE_TIM18()            SET_BIT(DBGMCU->CR2, DBGMCU_CR2_DBG_TIM18_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM18()          CLEAR_BIT(DBGMCU->CR2, DBGMCU_CR2_DBG_TIM18_STOP)
#endif

/**
  * @brief  TIM19 Peripherals Debug mode
  */
#if defined (DBGMCU_CR2_DBG_TIM19_STOP)
#define __HAL_DBGMCU_FREEZE_TIM19()            SET_BIT(DBGMCU->CR2, DBGMCU_CR2_DBG_TIM19_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM19()          CLEAR_BIT(DBGMCU->CR2, DBGMCU_CR2_DBG_TIM19_STOP)
#endif

/**
  * @brief  LPTIM Peripherals Debug mode
  */
#if defined (DBGMCU_CR2_DBG_LPTIM_STOP)
#define __HAL_DBGMCU_FREEZE_LPTIM()            SET_BIT(DBGMCU->CR2, DBGMCU_CR2_DBG_LPTIM_STOP)
#define __HAL_DBGMCU_UNFREEZE_LPTIM()          CLEAR_BIT(DBGMCU->CR2, DBGMCU_CR2_DBG_LPTIM_STOP)
#endif

/**
  * @}
  */

/** @defgroup SYSCFG_Exported_Macros SYSCFG Exported Macros
  * @{
  */

/**
  * @brief Enable the remapping of ETH_PTP_PPS.
  * @note  ENABLE: PTP_PPS is output on PB5 pin.
  * @note  This bit is available only in connectivity line devices and is reserved otherwise.
  * @retval None
  */
#define __HAL_SYSCFG_ETH_PTP_PPS_ENABLE()                SET_BIT(SYSCFG->CFGR[0], SYSCFG_CFGR1_PTP_PPS_REMAP)

/**
  * @brief Disable the remapping of ETH_PTP_PPS.
  * @note  DISABLE: PTP_PPS not output on PB5 pin.
  * @note  This bit is available only in connectivity line devices and is reserved otherwise.
  * @retval None
  */
#define __HAL_SYSCFG_ETH_PTP_PPS_DISABLE()               CLEAR_BIT(SYSCFG->CFGR[0], SYSCFG_CFGR1_PTP_PPS_REMAP)

/**
  * @brief The USB SOF for configuring CTC comes from USB1.
  * @retval None
  */
#define __HAL_SYSCFG_CTC_SOF_FROM_USB1()                 CLEAR_BIT(SYSCFG->CFGR[0], SYSCFG_CFGR1_CTC_SOF_SEL)

/**
  * @brief The USB SOF for configuring CTC comes from USB2.
  * @retval None
  */
#define __HAL_SYSCFG_CTC_SOF_FROM_USB2()                 SET_BIT(SYSCFG->CFGR[0], SYSCFG_CFGR1_CTC_SOF_SEL)

/** @brief  CCMSRAM page write protection enable macro
  * @param __CCMSRAMWRP__: This parameter can be a value of @ref SYSCFG_CCMSRAMWRP
  * @note   write protection can only be disabled by a system reset
  * @retval None
  */
/* Legacy define */
#define __HAL_SYSCFG_CCMSRAM_WRP_1_31_ENABLE   __HAL_SYSCFG_CCMSRAM_WRP_0_31_ENABLE
#define __HAL_SYSCFG_CCMSRAM_WRP_0_31_ENABLE(__CCMSRAMWRP__)    do {assert_param(IS_SYSCFG_CCMSRAMWRP_PAGE((__CCMSRAMWRP__)));\
                                                                     SET_BIT(SYSCFG->SWPR,(__CCMSRAMWRP__));\
                                                                   }while(0)

